Белгипрозем_2017/src/Catalogs/мКарточкиОбъектовРабот/мКарточкиОбъектовРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мКарточкиОбъектовРабот</name>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <owners>Catalog.мОбъектыРабот</owners>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поручение</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Составил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакетДокументов</name>
    <type>
      <types>CatalogRef.мПакетыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарточки</name>
    <type>
      <types>EnumRef.мВариантыКарточекИсходныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредоставленияДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.мСостоянияКарточекОбъектовРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельПредоставления</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникФинансирования</name>
    <type>
      <types>CatalogRef.мИсточникиФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОбъекта</name>
    <attributes>
      <name>ПараметрОбъекта</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Установлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ДокументЗаказчика</name>
      <type>
        <types>CatalogRef.мПакетыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредоставления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыДокумента</name>
    <attributes>
      <name>ДокументЗаказчика</name>
      <type>
        <types>CatalogRef.мПакетыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имеется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/мКарточкиОбъектовРабот/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Заказчик", Заказчик);
	Параметры.Свойство("Поручение", Поручение);
	Параметры.Свойство("ВидРабот", ВидРабот);
	Отбор = "";
	Параметры.Свойство("Отбор", Отбор);
	Отбор.Свойство("Владелец", ОбъектРабот);	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", ОбъектРабот));
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("Заказчик", Заказчик);
	ЗначенияЗаполнения.Вставить("Поручение", Поручение);
	ЗначенияЗаполнения.Вставить("ВидРабот", ВидРабот);
	ЗначенияЗаполнения.Вставить("ОбъектРабот", ОбъектРабот);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	//Если Копирование Тогда
	//	НаименованиеКопируемого = Элементы.Список.ТекущиеДанные.Наименование;
	//	СсылкаКопируемого = Элемент.ТекущиеДанные.Ссылка;
	//	ПараметрыФормы.Вставить("Копирование", Копирование);
	//	ПараметрыФормы.Вставить("НаименованиеОбъекта", НаименованиеКопируемого);
	//	ПараметрыФормы.Вставить("ПолноеНаименование", ПолучитьПолноеНаименованиеОбъектаРабот(СсылкаКопируемого));
	//	ПараметрыФормы.Вставить("СтруктураАдресаЗемельногоУчастка", ПолучитьСтруктуруАдресаЗемельногоУчастка(СсылкаКопируемого));
	//Иначе
	//	ПараметрыФормы.Вставить("Поручение", Поручение);
	//	ПараметрыФормы.Вставить("ВидРабот", ВидРабот);
	//КонецЕсли; 
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФормуМодально("Справочник.мКарточкиОбъектовРабот.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры
